[
  {
    "subject": "RE: The Autonomous Age: Humans in their zone of genius",
    "sender": "jpalomo@metpg.com",
    "date": "2025-09-19 13:17:06",
    "message_id": "199639f933950afa",
    "body": "Hi Srinivas,Just checking in to see if you had a chance to consider Amos Bar-Joseph as a guest for The Unmistakable Creative Podcast. Amos’s approach stands out because he’s not just talking about using AI in business, he’s living it—running a company that is scaling with AI agents instead of a big team. This journey is challenging all the old rules about growth, and the results are already sparking interest among 35,000 growth-focused executives Amos engages with regularly.Amos offers a candid look at what happens when you throw away the traditional growth playbook and replace it with autonomy, efficiency, and a new sense of creativity. His story is both unconventional and highly practical, and I think it aligns with the conversations you foster on the show.Thanks again for considering,Anne Palomo From: Anne Palomo Sent: Monday, September 15, 2025 6:02:10 PM To: srini@unmistakablemedia.com <srini@unmistakablemedia.com> Subject: The Autonomous Age: Humans in their zone of genius Hi Srinivas,Listening to your conversation with Paul Millerd about breaking away from the \"wrong life\" and assembling a set of principles for genuine fulfillment got me thinking about how we craft our own paths—sometimes in ways that completely flip the script on what business is supposed to look like.I wanted to introduce you to Amos Bar-Joseph. After scaling and exiting two B2B startups with the classic unicorn mentality, Amos realized that old playbook was losing meaning. He and two co-founders are now building Swan AI, aiming for $30M ARR using only themselves and a network of AI agents. No sprawling teams, just intelligence powering scale—a true experiment in autonomy, purpose, and reinvention.Amos believes the future belongs to businesses focused on scaling real human relationships, not headcount. His latest work with Swan AI is about designing agents that spot intent, qualify, and reach out to leads in a way that feels personal, yet entirely powered by AI. With a community of 35,000 executives invested in growth and GTM, Amos is igniting conversations around replacing conveyor-belt thinking with something a lot more meaningful.I think your audience would appreciate hearing how Amos navigated his own \"pathless path\" and what it really means to design a career—and company—on your own terms.Best,Anne Palomo",
    "tags": [
      "Relax"
    ]
  },
  {
    "subject": "bootstrapping a ugc startup in college - elijah’s story",
    "sender": "giselle@getvidovo.com",
    "date": "2025-09-19 12:03:05",
    "message_id": "199635bd1c298e6f",
    "body": "Hi Srinivas, Just wanted to circle back about connecting Elijah Khasabo with you for a possible Unmistakable Creative episode. Elijah brings a pretty cool mix of scrappiness and fresh thinking, both from bootstrapping Vidovo as a college student and from helping brands figure out how to tap authentic creators. He’s had to hustle for every \"yes,\" and his stories about building trust between brands and Gen Z creators are anything but boring. If you’re looking for a guest who’s worked the long nights, learned from the failures, and has strong opinions on where the creator economy is heading, Elijah’s got plenty to share. Let me know if I can answer anything else or help make an intro! Giselle",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "Question - Forbes & Business Insider Media Feature",
    "sender": "ava@roosterfl.com",
    "date": "2025-09-19 08:08:49",
    "message_id": "199628554422ce7b",
    "body": "Hello Srinivas Hope you don't mind me following up on this. I don't want to be a nuisance, but I know things can slip through the cracks. Just checking if you're the right person: Aura PR has exclusive media placements to feature select experts in the following media outlets: Forbes, Business Insider, Bloomberg, USA Today. Would you be interested soon? Warm regards, Ava Aura PR Managing Director",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "Re: Stew Tribe x The Unmistakable Creative Podcast",
    "sender": "david@aodcomms.com",
    "date": "2025-09-19 07:38:40",
    "message_id": "1996269ba4f87c2f",
    "body": "Hey there -I'm just following up on my recent email to see if you would be interested in having Stew Tribe as one of your next guests.If we’ve caught you at a busy time, we’d love to be able to circle back in the future to find a potential fit. If not, when would be a good time to set up next steps for an episode?Thanks!On Fri, Sep 12, 2025 at 1:33 PM David Zwick <david@aodcomms.com> wrote:Hello Srini - I’m reaching out to suggest Stew Tribe as one of the next guests for The Unmistakable Creative Podcast.Stew Tribe is Head of Agency Creative at The Fold, where he leads campaigns with an insight-centric ethos alongside the production team. Before The Fold, he spent six years at TBWA\\Chiat\\Day shaping work for brands like Gatorade, Airbnb, Google, and Nissan.Since The Unmistakable Creative Podcast highlights unique voices, Stew’s move from global agencies to The Fold exemplifies carving an unmistakable creative identity.We’d be open to discussing any potential conversational fits and would love to present the following episode topics should they provide an onramp: Why Small Batch Creative Leads to Big Impact - Based on his experience and motto at the fold, Stew can share the benefits of having creative and production brainstorming together at the start of any project. “Never present an idea you don’t love.” - It seems simple, but Stew can share multiple ways in which his team benefits from only pursuing ideas that they can stand behind. “We’ve swung too far into data.” - Data should guide, not dictate. Stew can share how handpicking talent, being selective with projects via a small batch creative team leads to stories marketing that can persuade humans via other humans, not just optimization for profit. Would you be interested in having Stew as a guest? Let me know and I’ll be glad to connect you with him for scheduling. Best,-- David ZwickPodcast Booking Specialistᐧ",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "Finished Copies Available: DIGITAL EXHAUSTION by Paul Leonardi (on sale October 7 from Riverhead Books)",
    "sender": "stavella@penguinrandomhouse.com",
    "date": "2025-09-17 12:50:00",
    "message_id": "199593a0d056ba16",
    "body": "Hi Srinivas, We’re not burned out, we’re digitally exhausted. From endless notifications to the pressure of always being “on,” our devices are quietly wearing us down. In his new book, DIGITAL EXHAUSTION: Simple Rules for Reclaiming Your Life (on sale October 7 from Riverhead Books), technology expert Paul Leonardi delivers a practical, research-backed roadmap for thriving in a hyperconnected world—without tossing your phone or quitting your job. The irony is not lost on me that I’m filling up your inbox with this pitch, but as Leonardi demonstrates, you can live your life, do your job, even scroll on TikTok, in ways that will still protect your energy. Drawing on two decades of research and consulting for companies like Google and Microsoft, Leonardi offers simple strategies that restore focus, energy, and control—whether you’re a professional buried in Slack, a parent navigating school apps, or a leader trying to model healthier tech habits. He’d make for a great guest this Fall – here are some clips from when he was on Brene Brown’s Dare To Lead and Minds Worth Meeting Podcast. Finished copies are now in, and we’d love to send you one for coverage consideration. Warmly, Shailyn Shailyn Tavella | Senior Publicity Manager | stavella@prh.com ﻿ Can't view this image? Click to view in your browser.",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "Transforming Workplaces with AI: Meet Monica Marquez",
    "sender": "monica@fts-ai.com",
    "date": "2025-09-17 08:20:13",
    "message_id": "19958430fec61708",
    "body": "Hi Srinivas,Just jumping in to follow up on my note from last week. I was thinking about how leaders are facing pressure to adopt AI responsibly and wondered if you’d be interested in sharing a conversation that demystifies practical ways to lead confidently as tech evolves.Having served on the ALPFA National Board and worked alongside Fortune 500 companies to build inclusive, future-ready cultures, I’m passionate about helping people find their place and voice in the workplace transformation. I’ve spent decades developing programs that open doors for underrepresented talent, and as a first-gen college grad from West Texas, I know how meaningful these stories can be for others seeking direction.If you’re open to it, I’d love to bring a fresh perspective to your show. With a resourceful and mission-driven audience of 20,000+ leaders, I believe there’s a lot we could unpack together for your listeners.Thanks again for considering this,Monica Marquez Monica MarquezFounder, FlipWork, Inc.",
    "tags": [
      "Read"
    ]
  },
  {
    "subject": "How ai is transforming reliability in industries?",
    "sender": "dc@practicalai.app",
    "date": "2025-09-17 06:22:07",
    "message_id": "19957d6ee07112c6",
    "body": "Hey Srinivas,Catching wind of your conversation with Paul Millerd on finding yourself in the wrong life and the true work of living really struck a chord. His journey to the \"good life\" through experiments and reframing challenges aligns closely with the twists of my own story. Like Paul, I felt that sense of being out of place until, at age 50, I was diagnosed autistic, ADHD, and dyslexic—turns out, the pathless path is sometimes the most valuable one.I'm reaching out because I've channeled those challenges into Practical AI—a community and consultancy empowering people to turn AI into real-world value, far from today’s hype. I’m obsessed with helping others experience the lightbulb moment, whether they're industrial engineers or creative \"misfits\" just trying to thrive on their own terms. At Amazon, I built the company’s highest-rated employee training program and have scaled that learner-first philosophy to thousands. With Pocket Mentor, we train techs 80% faster, save clients millions in costs, and make customer support both human and scalable. Our free Practical AI community welcomes neurodiverse and technically gifted folks—now over 6,500 strong—teaching them practical skills to grow their income immediately.I believe AI and autism are identical: both are misunderstood, both need translation, and both can spark brilliance in the right environment. If you’re seeking a guest who bridges cutting-edge tech with human understanding while delivering hands-on, actionable wisdom, I’d love to join you on The Unmistakable Creative Podcast.Best,D Crager AI Solutions Architect & Teacherhttps://practicalai.app/community",
    "tags": [
      "Relax"
    ]
  },
  {
    "subject": "Re: Reset Required: Reinstall OrchestrateOS (5-Minute Update)",
    "sender": "pamela@pamelawilson.com",
    "date": "2025-09-17 04:32:38",
    "message_id": "1995772b38b4daf4",
    "body": "That was helpful — thanks.I think I found an issue in the generated OPENAPI.YAML file.It originally gave me this: And when I pasted everything where it belonged, I got this:And then this when I tried to run it:So I changed the url to this:And now it’s all working.Srini, can you unlock the outline editor function for me? Of all the available options, that one seems most useful. I’d love to put it through its paces and use Orchestrate to do it.Pamela✅ PamelaWilson.comAbout Pamela Wilson LinkedIn | Perplexity | Author page On Sep 16, 2025, at 4:23 PM, Srinivas Rao <srini@unmistakablemedia.com> wrote:Hey Pamela, You're putting that in the wrong place. NO need for a pro subscription. But you're trying to edit regular chat GPt, not your custom GPT we created. Look under SORa in the left hand sidebar and you'll see GPT's. click on that and you'll see the OrchestrateOS GPT we created when we originally set it up. then go just click on that and then on the top left you should beagle to edit it's instructions I've seent you a short loom here too Guidance on Setting Up Your Custom GPT - Watch VideoHey Pamela, I wanted to follow up regarding your GPT setup. There's actually nothing wrong, and you don't need a pro subscription. Just go to your custom GPT and make sure to enter the YAML and instructions in the correct configuration screen instead of the regular chat GPT instructions. If you scroll down to the actions, you'll find where to input the orchestrate OS commands. Let me know if you have any questions!<image.png>The load OrcherateOPS commands goin in here under instructions <image.png>On Tue, Sep 16, 2025 at 6:11 AM Pamela Wilson <pamela@pamelawilson.com> wrote:Hey Srini,Finally had a chance to set this up, and here’s where I got stuck. I have a ChatGPT Plus plan — do I need a Pro plan for this to work?I’ll have time again on Friday to look at this. Let me know what I can try next.<Screenshot 2025-09-16 at 7.59.22 AM.png> Pamela✅ PamelaWilson.comAbout Pamela Wilson LinkedIn | Perplexity | Author page On Sep 12, 2025, at 10:17 AM, Srinivas Rao <srini@unmistakablemedia.com> wrote:Hi Pamela,We’ve rolled out major updates to OrchestrateOS, and a quick reset is required to get the latest version. It only takes about 5 minutes, and everything you need — including the .dmg installer and step-by-step instructions — is in the link below:👉 https://unmistakablemedia.getoutline.com/s/b3163875-6d12-40cf-aee6-53eaa3126ddcOnce you've completed the reinstall, just let us know and we'll add your unlock credits. If you previously unlocked tools like Outline, you'll also need to re-enter your credentials after reinstalling.Let us know if you hit any snags — we're happy to help.— Srini, Founder of OrchestrateOS -- Srinivas Rao Host/Founder at The Unmistakable Creative Podcast W https://unmistakablecreative.com/ E srini@uninmistakablemedia.com P : https://podcast.unmistakablecreative.com/ Create your own email signature",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "Problems with your AWS Account – Attention Needed",
    "sender": "no-reply@amazonaws.com",
    "date": "2025-09-17 03:47:44",
    "message_id": "199574996a98f633",
    "body": "(No content)",
    "tags": [
      "Relax"
    ]
  },
  {
    "subject": "Turning thought leadership into legacy with one asset",
    "sender": "doug@dougcrowe.com",
    "date": "2025-09-16 13:28:15",
    "message_id": "1995436b29b3e37d",
    "body": "Hey Srinivas,Just circling back in case my previous note got lost in the shuffle. I know your inbox is probably as busy as mine after a book launch. Having helped 270+ authors and plenty of CEOs stand out in crowded markets, I’ve learned that timing and messaging are everything. Sometimes those war stories about why most authors never recover from their first book launch, or how to stack real authority before a single Amazon review, make for conversations your listeners rarely get elsewhere.If you’re ever up for a discussion on pre-selling books, the hidden psychology behind legacy branding, or how to rise above the social media noise without shouting, I’m all in. With a community of 25,000 founders and purposeful entrepreneurs, I’m confident there’s overlap between our tribes and plenty we could dig into.No rush, just wanted to reconnect in case this piqued your curiosity again.Doug Crowe",
    "tags": [
      "Read"
    ]
  },
  {
    "subject": "podcast appearances for Srinivas",
    "sender": "jamie@castentryform.co",
    "date": "2025-09-16 13:25:58",
    "message_id": "19954349b2cf2b5b",
    "body": "Hi Srinivas, If we helped you appear on top podcasts (2/week) and grow your client base from it, would you be interested in a quick conversation? Kind regards, Jamie Atkinson Podcast Firestorm | Business Development Rep Orlando, FL \"Set your goals high, and don’t stop till you get there.\" – Bo Jackson \"If you don’t want follow-ups, reply 'no further emails please'.\"",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "neurologist & novelist — Dr. Sean Pauzauskie on the connection between medicine and fiction",
    "sender": "emma@pressshoppr.com",
    "date": "2025-09-16 11:33:31",
    "message_id": "19953cda88d82d87",
    "body": "Hi Srinivas,Would you like to speak with neurologist and novelist Sean Pauzauskie about the long-standing relationship between medicine and literature? He authored the forthcoming novel STAGE OF FOOLS (High Frequency Press; Oct 20), which sprung from the connection between the two disciplines: by day he studies the human brain with clinical probes; by night, he imagines the inner lives of characters. At first glance, they couldn’t seem more different, but both ask the same fundamental question: what does it mean to be alive and aware of the world?Pauzauskie argues that this overlap is not so surprising: doctors have long turned to literature—Chekhov, William Carlos Williams, Abraham Verghese, to name a few—because medicine itself begins in narrative. Patients arrive with fragments of a story, and physicians must interpret and weave them into a meaningful whole. Where medicine resolves uncertainty with lab results, fiction lingers in it.In STAGE OF FOOLS, the protagonist suffers from cognitive-motor dissociation, a condition in which patients may be fully conscious but appear comatose. Pauzauskie, who’s treated many people suffering from CMD, renders what it might feel like to live in that borderland between silence and speech, thought and action—territory he can only partially reach medically.Sean also works at the forefront of the emerging field of neurorights, helping craft landmark legislation to protect neural data—the electrical traces of thought and personhood. In an interview Sean can talk about:Why so many physicians turn to writing, and how diagnosis and narrative overlapHow literature and medicine approach human fragility from different anglesThe novel STAGE OF FOOLS and its roots in real neurological conditionsThe promise and perils of neurotechnology, and what it means for the future of consciousnessCan I send you a copy? Thanks for considering! Warmly,Emma McGlashenPublicist, PressShopPR.comE: emma@pressshoppr.comC: 734 834 0737ABOUT SEAN PAUZAUSKIEDr. Sean Pauzauskie is a practicing hospital neurologist in the University of Colorado system, where he conducts clinical research employing neurotechnology, primarily for the optimization of epilepsy management. He is the medical director of the NeuroRights Foundation, an active member of the American Academy of Neurology and The American Medical Association, and his research experience includes time at The National Institute of Mental Health, The Energy and Commerce Committee of the U.S. House of Representatives, and the Kaufmann Foundation for entrepreneurship.Born in Alaska and raised in Topeka, Kansas, Dr. Pauzauskie was mentored by and wrote his literature thesis with Stephen Jan Parker, a favorite pupil of Vladimir Nabokov. He lives with his wife and Siberian husky in the foothills of the Rocky Mountains. His literacy scholarship has been presented at the International Nabokov Society Conference in Montreux, Switzerland, and elsewhere. Stage of Fools is his debut novel. More at seanpauzauskie.com.Q&A WITH SEAN PAUZAUSKIESTAGE OF FOOLS is narrated by Steven Levinson, a man hospitalized and in a coma after nearly drowning. He hears what happens around him but cannot move or speak. This state of consciousness is not well-understood, but there is mounting research that suggests there is more brain activity in these patients than previously believed. As a neurologist, why did you choose to explore this condition in your novel?As they say, “write what you know.” At the start of my career I found determining a prognosis for comas among the most difficult cases medically and scientifically, precisely because of how little the condition reveals. When I learned about cognitive-motor dissociation (CMD), which is a newly discovered state of consciousness wherein coma patients are mentally active while still physically immobile, it excited and concerned me. It was exciting because it offered physicians new avenues to do the most good for people in each unique situation—and concerning because it made me question if we give up hope too soon in certain instances, as we know CMD confers improved outcomes even if it presents identically to less optimistic situations. I believed a novel exploring CMD would help me and others process this knowledge, as well as honor and raise awareness about these patients who can’t speak for themselves.Why set this novel within the framework of Shakespeare’s King Lear?I wanted to tell a contemporary story in a classic way, and Shakespeare has always lent itself well to this pursuit. In our world of billionaires and oligarchs, seeing if a King Lear can learn from his mistakes also poses the question of if anything truly changes or if the same old story holds in modern times. Furthermore, a character in a coma allows for frequent soliloquy, which draws in an audience by sharing private thoughts, in the stage-like setting of a hospital room. The play King Lear as a whole also fits my narrative best, with his lifetime of lived experiences to consider and his intense rumination on his compromised judgment that literally drives him mad. I additionally wanted to explore the Jungian notion that “those who look outward, dream; while those who look inward, awaken,” which I felt this framework could simultaneously accomplish.The book is filled with family intrigue and profound personal development. Have you seen people in the room with non-responsive patients act in the same ways the characters in the book do? And for people who do recover, are they typically lucid, confused, radically changed?I do see patients and families react similarly to the characters in the book though not to the same extremes as Levinson’s children. It is well known that in times of crisis, families revert to their core elements and all the tensions that can spell. So oftentimes having the privilege to care for these patients also demands an equal and sometimes greater effort to aid the families as they navigate that crisis. We hope this prevents such heightened drama, though some drama is natural and impossible to completely avoid. As for those who recover, they are seldom the same people afterwards. Memory, mood, sleep, and even personality can be altered. Sometimes we also see dramatic shifts in a person’s interests,values, and sense of identity.The book features an emerging real-world treatment called ultrasonic thalamic stimulation—what does that procedure do and why did you incorporate it into your story?There are broadly two types of neurotechnologies: those that read brain activity, and those that directly influence it. Ultrasonic thalamic stimulation directly influences brain activity by using soundwaves to stimulate the thalamus, an olive-sized structure deep in the brain that plays an important role in maintaining consciousness, to attempt to “jumpstart” it the same way you might jumpstart a car’s engine. I chose to feature it in the book because it suits the story and because I wanted to raise awareness about such experimental treatments. Every life-saving therapy that we take for granted now was once in the experimental stage, and we expect that neurology will see more of these treatments come to fruition than any other field over the next five to ten years. And so I wanted to portray what this might look like, as I’m hopeful for the tools available to neurology practice and most importantly, for patients.Why did you choose to use “the stillness of a coma” as a narrative device for Steven’s character? How did it help him reflect or change in ways he otherwise wouldn’t have?The stillness of a coma helps to portray Steven’s development. He’s able to narrate with more candor, more frequently. With no one there to argue the facts with him, he’s able to remember everything deep within his mind. This honest, isolated depth of reflection allows him to change in ways he wouldn’t if, for example, he had to argue with his family over what was real and imagined from his life, whose version of the story was accurate.This narrative device also allows Steven’s imagination to flourish and permit the reader to make judgments about what it says about him. If memory is imagination or a form of fiction itself, as some suggest, this vantage point helps this idea resonate on the page.You’re the Medical Director of Neurorights Foundation, an organization that advocates for brainwave privacy in the face of rapid innovations in neurotechnology. Though a work of fiction, the stakes of this novel are very real. How does the emerging issue of neurotech rights provide context for your story?Writing this novel was nearly simultaneous to my involvement with the Foundation, so it’s somewhat surreal to see the two growing together and converging. I see them as different expressions of the same underlying issue: through neurotechnologies, the brain and mind are poised for revolutionary change that will redefine what it means to be human. As technology itself is fundamentally ethically neutral, it is up to us to ensure that more good than harm comes from them, as we have thus far seen with the nuclear, genetic, and information revolutions of the 20th century. Narrative will be a key factor driving the public adoption of neurotechnology, as the Foundation has discussed at length. This novel, I hope, contributes to this narrative by exploring one patient’s issues in an intensive care unit vis-a-vis the promises of neurotechnology, as a representation of the 21st-century world soon to change.PRAISE FOR STAGE OF FOOLS\"Sean Pauzauskie is from that great tradition of doctors who also excel in literature. As with Walker Percy, another example, we get in Pauzauskie’s Stage of Fools the tragicomedies of the flesh as well as the acutely sketched-out questions about the mind and the soul. Sean Pauzauskie is a very promising novelist, with a big heart and unique angle, as shown in this uniquely rewarding new work.\" —Rick Moody, author of The Ice Storm“Stage of Fools offers an innovative, compelling appropriation and repurposing of Shakespeare’s King Lear. But the principal character lies comatose in a San Francisco hospital, able to hear, think, and feel. Recollection and disintegration drive a bold family narrative toward a riveting conclusion and epiphany. Pauzauskie, by creating multi-faceted characters, skillfully refashions the story of an old king into a modern-day enriched parable of hope, suffering, and loss.” —David Bergeron, author of The Duke of Lennox",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "Re: Stew Tribe x The Unmistakable Creative Podcast",
    "sender": "david@aodcomms.com",
    "date": "2025-09-16 10:18:14",
    "message_id": "1995388bcea5b9e4",
    "body": "Hello again Srini -I’m just following up on my recent email to see if you would be interested in having Stew Tribe as one of your next guests. Recently, as a contributing writer for Uber Eats campaign “Football is for Food,” Stew won a Gold Lion for Humor.Would you be open to scheduling a short conversation with his team to see if this is a potential fit?Thank you for your consideration.On Fri, Sep 12, 2025 at 1:33 PM David Zwick <david@aodcomms.com> wrote:Hello Srini - I’m reaching out to suggest Stew Tribe as one of the next guests for The Unmistakable Creative Podcast.Stew Tribe is Head of Agency Creative at The Fold, where he leads campaigns with an insight-centric ethos alongside the production team. Before The Fold, he spent six years at TBWA\\Chiat\\Day shaping work for brands like Gatorade, Airbnb, Google, and Nissan.Since The Unmistakable Creative Podcast highlights unique voices, Stew’s move from global agencies to The Fold exemplifies carving an unmistakable creative identity.We’d be open to discussing any potential conversational fits and would love to present the following episode topics should they provide an onramp: Why Small Batch Creative Leads to Big Impact - Based on his experience and motto at the fold, Stew can share the benefits of having creative and production brainstorming together at the start of any project. “Never present an idea you don’t love.” - It seems simple, but Stew can share multiple ways in which his team benefits from only pursuing ideas that they can stand behind. “We’ve swung too far into data.” - Data should guide, not dictate. Stew can share how handpicking talent, being selective with projects via a small batch creative team leads to stories marketing that can persuade humans via other humans, not just optimization for profit. Would you be interested in having Stew as a guest? Let me know and I’ll be glad to connect you with him for scheduling. Best,-- David ZwickPodcast Booking Specialistᐧ",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "the hiring framework that nobody teaches",
    "sender": "tom@getsuperhired.com",
    "date": "2025-09-16 07:12:07",
    "message_id": "19952de587615a66",
    "body": "Hi Srinivas,Just looping back since I’m still thinking about the fit between Josh Hill’s story and what your audience connects with. There’s a certain paradox he embodies that I haven’t seen elsewhere. Here’s what I mean: Josh has commanded more than 150 soldiers as a military officer, then pivoted to leading global employee experience at Tier 11—not by following the script, but by completely reimagining the relationship between people and organizations. His view? Instead of employees being passive recipients of culture, they’re active subscribers making a daily choice, which is a real shift from traditional HR.What if the way we structure talent really is due for a creative overhaul, one led by people who’ve seen high-stakes leadership and then applied it to remote teams across the world? Josh’s co-founder role at SuperHired also means he’s living this intersection of AI, recruitment, and the very human art of talent discovery. I’m constantly surprised by one thing he found: when you approach recruitment as if each candidate’s experience is a product in itself, even rejected applicants become your best advocates. That’s not common in business, especially at scale.Would love to explore this dynamic with your audience. If you’re interested in hearing a bit more or want to talk through possibilities, just let me know.Tom MeredithP.S. Josh sometimes jokes that his strict military discipline is now channelled into onboarding spreadsheets—maybe that’s the hidden secret to retention. Tom MereditCo-Founder @ SuperHiredBuilding talent density, not headcount.superhired.aiLinkedIn",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "How Tamara Laine Is Redefining Financial Access with AI for Gig Workers",
    "sender": "tamara@mpwrai.com",
    "date": "2025-09-16 06:12:13",
    "message_id": "19952a7818bba333",
    "body": "Hi Srinivas,I wanted to touch base in case my previous message slipped through the cracks. Your show continues to stand out to me as a gathering place for conversations about creative problem-solving and authentic impact, and I’d still love to join you as a guest.Alongside my work as the founder of MPWR, I’ve been fortunate to spotlight crucial topics such as financial literacy for gig workers and underserved communities, drawing from both personal and professional experience. I’ve also led documentary projects like Scratching the Surface, which explored the early release of genetically modified mosquitoes, earning recognition for pushing difficult but important conversations forward.Building inclusive spaces for women and underrepresented founders is core to my work, and I’ve had the chance to contribute to platforms ranging from The World Bank to Forbes. My efforts to merge strategy, tech, and advocacy have helped me create a growing community of over 7,000 people, and I’d be excited to help share your show with them.If you’re still looking for guests interested in diving into these intersections of creativity, finance, and social change, I’d be thrilled to connect.All the best,Tamara Laine Let's connect on LinkedIn! \"The future belongs to those who believe in the beauty of their dreams.\"",
    "tags": [
      "Read"
    ]
  },
  {
    "subject": "Re: Reset Required: Reinstall OrchestrateOS (5-Minute Update)",
    "sender": "pamela@pamelawilson.com",
    "date": "2025-09-16 06:11:49",
    "message_id": "19952a7225a5d39d",
    "body": "Hey Srini,Finally had a chance to set this up, and here’s where I got stuck. I have a ChatGPT Plus plan — do I need a Pro plan for this to work?I’ll have time again on Friday to look at this. Let me know what I can try next. Pamela✅ PamelaWilson.comAbout Pamela Wilson LinkedIn | Perplexity | Author page On Sep 12, 2025, at 10:17 AM, Srinivas Rao <srini@unmistakablemedia.com> wrote:Hi Pamela,We’ve rolled out major updates to OrchestrateOS, and a quick reset is required to get the latest version. It only takes about 5 minutes, and everything you need — including the .dmg installer and step-by-step instructions — is in the link below:👉 https://unmistakablemedia.getoutline.com/s/b3163875-6d12-40cf-aee6-53eaa3126ddcOnce you've completed the reinstall, just let us know and we'll add your unlock credits. If you previously unlocked tools like Outline, you'll also need to re-enter your credentials after reinstalling.Let us know if you hit any snags — we're happy to help.— Srini, Founder of OrchestrateOS",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "Re: Srinivas - question",
    "sender": "jesus@transparentprofitpath.co",
    "date": "2025-09-16 05:35:49",
    "message_id": "19952862ca9c153f",
    "body": "Srinivas, which sounds more interesting, calling 1,000 potential clients per day or emailing 100,000 a month? Jesus Pacheco ProfitPath Growth Partners On Fri, September 12, 2025 3:56 PM, Jesus Pacheco [jesus@transparentprofitpath.co]> wrote: > Hi Srinivas,We just helped a tech company secure 12+ meetings with decision-makers in the software industry using our targeted outreach approach.Most companies rely solely on their existing networks to find new clients.We can connect with every ideal prospect in your target market and engage them effectively.Interested? > > > Jesus Pacheco > Head of Business Development > ProfitPath Growth Partners >",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "bootstrapping a ugc startup in college - elijah’s story",
    "sender": "giselle@getvidovo.com",
    "date": "2025-09-15 13:09:03",
    "message_id": "1994efec74501800",
    "body": "Hey Srinivas, Just listened to The Unmistakable Creative Podcast and loved it. It really aligns with what we are doing in the creator space. It reminded me of Elijah Khasabo, co-founder of Vidovo, a UGC platform used by over 100 brands. His story started in community college with a random video that hit 14 million views and led to building Vidovo from the ground up. Since then, Vidovo has grown to represent over 5,000 creators and worked with notable brands like Forbes, Notion, and Momentous. Elijah’s sharp, real, and has a lot to say about how Gen Z is shaping the creator space. I think he’d be a great fit for The Unmistakable Creative Podcast. Let me know what you think. Best, Giselle",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "The Autonomous Age: Humans in their zone of genius",
    "sender": "jpalomo@metpg.com",
    "date": "2025-09-15 11:02:15",
    "message_id": "1994e8aad5e392ea",
    "body": "Hi Srinivas,Listening to your conversation with Paul Millerd about breaking away from the \"wrong life\" and assembling a set of principles for genuine fulfillment got me thinking about how we craft our own paths—sometimes in ways that completely flip the script on what business is supposed to look like.I wanted to introduce you to Amos Bar-Joseph. After scaling and exiting two B2B startups with the classic unicorn mentality, Amos realized that old playbook was losing meaning. He and two co-founders are now building Swan AI, aiming for $30M ARR using only themselves and a network of AI agents. No sprawling teams, just intelligence powering scale—a true experiment in autonomy, purpose, and reinvention.Amos believes the future belongs to businesses focused on scaling real human relationships, not headcount. His latest work with Swan AI is about designing agents that spot intent, qualify, and reach out to leads in a way that feels personal, yet entirely powered by AI. With a community of 35,000 executives invested in growth and GTM, Amos is igniting conversations around replacing conveyor-belt thinking with something a lot more meaningful.I think your audience would appreciate hearing how Amos navigated his own \"pathless path\" and what it really means to design a career—and company—on your own terms.Best,Anne Palomo",
    "tags": [
      "Read"
    ]
  },
  {
    "subject": "Srinivas - Quick Question",
    "sender": "office@natalieindubai.com",
    "date": "2025-09-15 08:23:23",
    "message_id": "1994df93a2d71210",
    "body": "Hello Srinivas, not sure how often you check LinkedIn — I thought this might be interesting for you. There’s an upcoming live session called: \"Discover How to Make 35%+ in Dubai Real Estate\". It’s practical, concise, and made for individuals like you. Would it be okay if I send you the invite for Sunday at 11AM Central Time? P.S. In the session, I’ll break down how our clients multiply their capital every 6 years. Natalie Zachary",
    "tags": [
      "Read"
    ]
  },
  {
    "subject": "AI Education & Ethics: Why Ben Tasker Stands Out",
    "sender": "media@flocommunications.com",
    "date": "2025-09-15 07:42:09",
    "message_id": "1994dd37ad5284e7",
    "body": "Hey there Srinivas,I wanted to introduce you to the former Dean of AI at Southern NH University Ben Tasker, who I believe would be a great fit as a guest on The Unmistakable Creative Podcast.Ben Tasker is a recognized leader in AI education, workforce transformation, and responsible AI adoption. He currently leads a Data & AI Academy focused on upskilling and reskilling 36,000 employees in the public utility sector, ensuring the workforce is AI-ready for the future. He also serves as a Technical Advisor for uCertify, a global leader in workforce certification and reskilling.Previously, Ben was the Dean of AI at Southern New Hampshire University, where he spearheaded Applied AI programs and pioneered a skills institute focused on workforce AI + Human upskilling and reskilling. He also teaches as a part-time faculty member at Northeastern University’s Khoury College of Computer Sciences, one of the world’s top universities for AI education.Earlier in his career, Ben was a project manager at Northeastern’s Experiential AI Institute, creating technical and responsible AI Products for companies like Two Sigma and Unum Insurance. He also served at MaineHealth as a former Data Scientist, where his integration of AI products enabled predictive diagnostic tools that directly contributed to saving lives.Ben’s accomplishments and experience as a data scientist, AI product leader, and educator makes him uniquely positioned to discuss how AI is reshaping learning, workforce development, and the future of education. Furthermore, he speaks to how AI can be used for the benefit of society, rather than detriment, like the narratives we see pushed today. Let me know if you'd like to have him on the show! Best regards,Eve Bailey Media",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "From burnout to breakthrough: Sid Jashnani on scaling with meaning",
    "sender": "lenie.podcast@gmail.com",
    "date": "2025-09-14 17:34:52",
    "message_id": "1994acbc7dc316b3",
    "body": "Hi Srinivas, I’m reaching out to suggest a guest who I think would deeply resonate with your audience of creatives, entrepreneurs, and changemakers. Sid Jashnani is a Certified EOS Implementer®, Founder of Rekruuto, leadership coach, and holdco entrepreneur. He’s built and acquired companies across the US, UK, EU, India, and the Middle East, but his most powerful story is personal: years ago, while running a $4M IT company, he was stuck in low-value tasks, constantly firefighting, and on the brink of burnout. Everything changed when he discovered and implemented EOS®. It not only transformed his company—scaling it from $4M to $35M—but also gave him the freedom to focus on purpose and growth. Today, Sid helps leaders around the world reclaim their time, clarity, and freedom by combining systems like EOS with the power of offshore talent. His story is equal parts cautionary tale and blueprint for building a business that serves your life, not the other way around. Suggested episode idea: “From Chaos to Clarity: How to Scale Without Losing Yourself” Sid shares his journey of turning burnout into breakthrough, why so many entrepreneurs get trapped in the $15/hour work cycle, and how leaders can design businesses that give them meaning, autonomy, and impact. SID JASHNANICertified EOS Implementer®Founder of RekruutoLeadership Coach HoldCo Entrepreneur✅ LinkedIn✅ Instagram✅ Media Profile Would you be open to exploring Sid as a guest for The Unmistakable Creative Podcast? Warm regards, Lenie Fernandez📧 lenie.podcast@gmail.com📞 (+63) 991 652 8861🌐 https://calendly.com/lenivie-fernandez/🎧 “Connecting Visionaries with Engaging Conversations”",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "Transforming Workplaces with AI: Meet Monica Marquez",
    "sender": "monica@fts-ai.com",
    "date": "2025-09-13 08:18:03",
    "message_id": "19943a7a270e5527",
    "body": "Hi Srinivas,The way you dive into how creativity intersects with resilience and meaning really struck a chord with me. It inspired me to reach out, as much of my work centers around helping people adapt, lead, and thrive in fast-evolving workplaces—especially as AI becomes part of every professional’s daily reality.With over 25 years guiding leaders across Google, Goldman Sachs, and more, I’ve worked at the crossroads of transformation, talent, DEI, and leadership. One of my proudest contributions was pioneering and naming \"returnship\" at Goldman Sachs, which became the global benchmark for bringing talented professionals back to the workforce. At Google, I also helped establish the Product Inclusion Council to drive more thoughtful, equitable product decisions. Today, I advise and speak to organizations eager to unlock practical, human-centered ways to integrate AI into work and life.Your audience would find tangible value in stories and strategies for building genuine confidence and clarity as they navigate change. As a cofounder of FlipWork and Beyond Barriers, I’ve helped over 20,000 professionals reimagine what’s possible, and I’d love to bring that perspective to your listeners.Thanks for considering me for a future episode.Monica Marquez Monica MarquezFounder, FlipWork, Inc.",
    "tags": [
      "Read"
    ]
  },
  {
    "subject": "Stew Tribe x The Unmistakable Creative Podcast",
    "sender": "david@aodcomms.com",
    "date": "2025-09-12 13:33:53",
    "message_id": "1993fa26ff07698c",
    "body": "Hello Srini - I’m reaching out to suggest Stew Tribe as one of the next guests for The Unmistakable Creative Podcast.Stew Tribe is Head of Agency Creative at The Fold, where he leads campaigns with an insight-centric ethos alongside the production team. Before The Fold, he spent six years at TBWA\\Chiat\\Day shaping work for brands like Gatorade, Airbnb, Google, and Nissan.Since The Unmistakable Creative Podcast highlights unique voices, Stew’s move from global agencies to The Fold exemplifies carving an unmistakable creative identity.We’d be open to discussing any potential conversational fits and would love to present the following episode topics should they provide an onramp: Why Small Batch Creative Leads to Big Impact - Based on his experience and motto at the fold, Stew can share the benefits of having creative and production brainstorming together at the start of any project. “Never present an idea you don’t love.” - It seems simple, but Stew can share multiple ways in which his team benefits from only pursuing ideas that they can stand behind. “We’ve swung too far into data.” - Data should guide, not dictate. Stew can share how handpicking talent, being selective with projects via a small batch creative team leads to stories marketing that can persuade humans via other humans, not just optimization for profit. Would you be interested in having Stew as a guest? Let me know and I’ll be glad to connect you with him for scheduling. Best,-- David ZwickPodcast Booking Specialistᐧ",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "Re: Investor Introduction, Srinivas",
    "sender": "jakeivalentine@dealflowventure.com",
    "date": "2025-09-12 11:00:33",
    "message_id": "1993f16086233f55",
    "body": "Hi Srinivas – are you still accepting new LP commitments? If you are, then maybe it’d be valuable to have a conversation. At DealFlow, we specialize in connecting emerging and mid-sized funds with institutional investors – leveraging direct LP engagements, our trusted LP base, and strategic multi-channel campaigns. We’re collaborating with fund managers you’ve probably heard of and are highly engaged within institutional circles across key markets in the US, Europe, and MENA. Our team has developed an institutional pipeline exceeding $750M and logged 220+ LP confirmations, while consistently setting up conversations with institutions like Bank of America, Yale’s endowment, and Adams Street Partners. I’ve seen growing investor interest in the industries you invest in – so I wanted to connect. Either way, I’ll make this my final follow-up – but feel welcome to contact me in the future if the timing isn’t right. Otherwise, I’d be glad to send over additional info. Looking forward, Co-Managing Partner | DealFlow On Thu, Sep 11, 2025 4:18:39 PM Jake Valentine wrote: > Hello Srinivas, > > I found your profile on Pitchbook and saw you’re currently raising capital. > > We’ve built trusted relationships with capital allocators who are looking to invest $10M–$25M in your sector in the near term. > > We’ve built and managed over $750M in committed investor interest with 220+ LPs signaling active interest and have arranged meetings with top-tier LPs such as Adams Street Partners, Bank of America, and Yale’s endowment. > > I’d be interested to explore if there are ways we can collaborate. > > Let me know if I can share some further information. > > Looking forward to your thoughts! > > Looking forward, > Jake A. Valentine > Executive Partner | DealFlow",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "Srinivas, Touching base on your Working Capital Approval for Unmistakable Media",
    "sender": "noah.cohen@excelfundingsolution.com",
    "date": "2025-09-12 10:03:07",
    "message_id": "1993ee174e7cbb69",
    "body": "Greetings Srinivas, I wanted to follow up on the proposal we shared with your brokers for your consideration. I’m not clear if they’ve been able to share the specifics, so I wanted to personally ensure you have received the information. Below is the proposal: * Total Funding: 190,000 * Repayment Amount: 226,100 * Payment Amount: 3,768 * Frequency: Monthly * # Of Payments: 60 This proposal provides flexible working capital to help you develop and manage your business efficiently. If you’d like to proceed, we can accelerate the timeline and have the funds available in no time. Simply reply to this email, and I’ll personally assist you with the next steps. If this isn’t the right time, no worries—you can inform us by replying with “Not Interested,” and we’ll take care of it. Best Regards, Noah Cohen Quick Capital Solutions Capital Consultant 40 Wall Street, NYC 10005",
    "tags": [
      "Read"
    ]
  },
  {
    "subject": "Turning thought leadership into legacy with one asset",
    "sender": "doug@dougcrowe.com",
    "date": "2025-09-12 08:56:07",
    "message_id": "1993ea41e68ca95f",
    "body": "Hey Srinivas,Your latest episode with Kevin Surace was spot on—AI isn’t ending our work, but it’s exposing which of us are really bringing value beyond repetition. When Kevin called out the shift from task-based work to insight-driven results, I nodded along from 40 years of watching leadership and creative industries chase the next shiny thing, only to realize relationships and trust always outlast tech cycles.You’ve built The Unmistakable Creative into a playground for deep personal stories and sharp perspectives. I’m wired the same. I’ve guided bestselling authors (including C-suite folks from Apple, NASA, and Louis Vuitton) and worked alongside founders who are more interested in meaning than quick wins. These days, my favorite conversations center on the humanity behind creation: Does AI signal the extinction of writing? Or, why relationships trump any social algorithm?If you ever want to riff on why 99 percent of authors kill their value before their book hits Amazon, or how legacy-building is quietly becoming the best form of future-proofing, I’d be game. My audience of 25,000 legacy-driven founders and creators would likely cross over well with your own curious misfits.Let me know if you want to jam on the crossroads of AI, storytelling, and the kind of influence no software can automate.Doug Crowe",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "Mark Fitzgerald on Turning AI Strategies into Real-World Impact",
    "sender": "bailey@awordsmith.com",
    "date": "2025-09-12 05:52:25",
    "message_id": "1993dfbf2b8ec4b2",
    "body": "Hi Srinivas,There’s something strangely captivating about how organizations transform when they’re standing at the edge of big change. That thought kept popping into my head as I was thinking about your podcast and how you explore creativity, reinvention, and pushing past comfort zones.I wanted to introduce you to Mark Fitzgerald, who leads Propeller’s Denver office and heads their AI Strategy group. Mark has spent nearly three decades guiding Fortune 500 companies through moments where growth, uncertainty, and ambition all collide. What really sets him apart is how he helps leaders translate bold ideas, especially around AI, into real, meaningful progress, even amid uncertainty.Mark is passionate about making AI accessible, practical, and something companies can embrace as a teammate. He’s shared his perspective in places like Unite.AI and CIO, particularly on turning the complexity of the 4 V’s of AI into genuine outcomes. His experience around business transformation and leadership, especially rooted in the evolving Colorado tech scene, could deliver the kind of conversation that’s right at home on your show.Would you be open to exploring a conversation with Mark? I think your audience would genuinely appreciate his clarity and grounded wisdom.Best,Bailey Hopp",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "Investor Introduction, Srinivas",
    "sender": "jakeivalentine@dealflowventure.com",
    "date": "2025-09-11 13:18:43",
    "message_id": "1993a6e2d1103770",
    "body": "Hello Srinivas, I found your profile on Pitchbook and saw you’re currently raising capital. We’ve built trusted relationships with capital allocators who are looking to invest $10M–$25M in your sector in the near term. We’ve built and managed over $750M in committed investor interest with 220+ LPs signaling active interest and have arranged meetings with top-tier LPs such as Adams Street Partners, Bank of America, and Yale’s endowment. I’d be interested to explore if there are ways we can collaborate. Let me know if I can share some further information. Looking forward to your thoughts! Looking forward, Jake A. Valentine Executive Partner | DealFlow",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "Team Intelligence: How Brilliant Leaders Unlock Collective Genius by NYT bestselling author, Jon Levy (Harper Business, 10/7)",
    "sender": "Rachel.Elinsky@harpercollins.com",
    "date": "2025-09-10 13:21:33",
    "message_id": "199354a6b25ce59a",
    "body": "Dear Srinivas, Hope this message finds you well&#8212;I&#8217;m writing today regarding New York Times bestselling author Jon Levy&#8217;s new book, TEAM INTELLIGENCE: How Brilliant Leaders Unlock Collective Genius (Harper Business, 10/7). Roy Wood Jr., host of CNN Have I Got News for you and former Daily Show correspondent says, &#8220;Team Intelligence is like a TED Talk that got tired of being polite and started telling the truth.&#8221; Ever wonder why some of our most effective leaders aren&#8217;t known for the skills we&#8217;ve been told are essential for great leadership? Would you describe Elon Musk or Steve Jobs as having empathy or humility? Of course not, and yet they&#8217;ve led teams that achieved extraordinary results. So, what leadership attributes, habits, and skills do cause teams to become more than the sum of their parts? Why does a team made up of superstars often underperform? What causes teams to work together effectively and produce high team intelligence? For the past fifteen years behavioral scientist and New York Times bestselling author Jon Levy has gathered thousands of the most respected leaders from across industry&#8212;Nobel Laureates, Olympic team captains, astronauts who commanded the ISS, military leaders, and corporate CEOs&#8212;to find answers to these questions. In TEAM INTELLIGENCE, he unpacks the myths that hold leaders and their teams back and points out the paradox of success: focusing on creating teams that operate well is what makes an effective leader, but focusing purely on the leader does almost nothing for the team. In TEAM INTELLIGENCE discover cutting-edge research, surprising stories, and the essential habits that unlock collective genius. Let me know if I can send over an early copy (digital or physical) and look forward to connecting with you soon. Warmest, Rachel More information below: ABOUT THE AUTHOR Jon Levy is a behavioral scientist and New York Times Best Selling author renowned for his groundbreaking insights on trust, leadership, teams, and influence. His speaking and consulting are sought after by both the Fortune 500 (Microsoft, Google, AB-InBev, Samsung, Merck, etc.) and startups. Over fifteen years ago, Levy founded The Influencers, a private dining experience where the guests cook dinner together but can&#8217;t discuss their careers until mealtime, only to discover they are dining with some of the most respected leaders across industry (Nobel laureates, Olympians, executives, astronauts, military heroes, celebrities, royalty, etc.). With thousands of members, Influencers is the largest community of its type worldwide. Team Intelligence: How Brilliant Leaders Unlock Collective Genius Praise for TEAM INTELLIGENCE &#8220;I love this book! I&#8217;ve never seen anything so simple and clear and funny at the same time. Like it or not, we&#8217;re all leaders of something, so this is for you!&#8221; &#8212; John C. Mather, winner of the 2006 Nobel Prize in Physics &#8220;This book is a manual for building high-functioning teams&#8212;on Earth or in outer space.&#8221; &#8212; Terry Virts, NASA astronaut (Ret.), and former International Space Station commander, colonel of the US Air Force, and F-16 test pilot &#8220;Team Intelligence challenges the myth of the singular leader and replaces it with the vision that when people are respected and heard, they can collaborate to achieve the extraordinary.&#8221; &#8212; Princess Mabel van Oranje, serial entrepreneur for social change &#8220;If you want podium-level results, stop managing people and start building team intelligence. This book is the blueprint for a team pursuing anything from Olympic gold to business success.&#8221; &#8212; Gary Hall Jr., ten-time Olympic medalist, Olympic Hall of Fame inductee, and US Olympic team captain &#8220;Like Professor Xavier or Optimus Prime, Jon Levy is one of those souls who makes you better in every aspect. His book gives you the gift of being the best leader you can be and bringing out the very best in those around you.&#8221; &#8212; Tom DeSanto, writer-producer of X-Men and Transformers &#8220;I&#8217;ve spent my career in labs full of smart people. The teams that succeeded weren&#8217;t always the smartest&#8212;they were the best at working together. This book explains why that matters.&#8221; &#8212; Michael Brown, winner of the 1986 Nobel Prize in Medicine or Physiology &#8220;Behind every award-winning show is a team that made it possible. Team Intelligence offers a powerful, practical guide to building those teams&#8212;when culture drives creativity, and trust is paramount.&#8221; &#8212; Camille Bidermann, executive director, International Academy of Television Arts & Sciences, and executive producer, International Emmy Awards &#8220;Team Intelligence breaks down the hidden systems that separate high-performing teams from merely talented ones. It&#8217;s Moneyball for leadership.&#8221; &#8212; Daryl Moore, president, Philadelphia 76ers _____________________ Rachel Elinsky Senior Director of Publicity HarperCollinsPublishers rachel.elinsky@harpercollins.com ************************************************** Confidentiality Notice: This E-Mail is intended only for the use of the individual or entity to whom it is addressed and may contain information that is privileged, confidential and exempt from disclosure under applicable law. If you have received this communication in error, please do not distribute and delete the original message. Please notify the sender by E-Mail at the address shown. Thank you for your compliance.",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "Podcast Must-Have: Meet the CEO Revolutionizing How Entrepreneurs Delegate & Scale with Virtual Teams!",
    "sender": "Sam@podpromax.com",
    "date": "2025-09-09 06:43:20",
    "message_id": "1992eb77a4111c4d",
    "body": "Hi Srini, I’d love to introduce to you a guest who your audience needs to hear from! Meet Brittany Bettini, the Founder & CEO of I Need a VA, and the leading authority in virtual staffing for entrepreneurs ready to scale smart. Unlike platforms like Fiverr or Upwork that offer quick hires with little support, Brittany has built a high-touch, results-driven alternative that’s helping six- and seven-figure founders scale intentionally by pairing them with trained, high-level VAs and equipping them with the leadership skills to delegate powerfully. She’s on a mission to teach founders how to escape burnout, reclaim their time, and grow sustainably by treating virtual staffing not as a transaction, but as a strategic partnership. Key Talking Points Your Audience Will Love: The truth about Fiverr/Upwork, and how to avoid costly hiring mistakes with virtual talent How to hire and lead your first VA the right way, so you can reclaim your time and freedom Why most entrepreneurs fail at delegation, and the 3 systems they need to scale without overwhelm Her journey from domestic violence survivor to CEO and upcoming author of She Delegates, a powerful blueprint for women entrepreneurs who want to lead and live on their terms She has been interviewed on shows such as Cultivating H.E.R. Space, Small Biz Tips, and The Foxy Mama Podcast to name a few, which highly showcase her aligned values and experience. With clients earning $10K/month+ and facing the tipping point of burnout, Brittany speaks directly to your listeners who are ready to build a real team, but don’t know where to start. She’s not just handing out VAs, she’s coaching CEOs and their assistants to scale together, while creating real growth and long-term retention. Let me know if you’d like to have Brittany on your show, and I'll make everything hassle-free! Best regards, Sam",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "Action required – Your AWS account is past due",
    "sender": "no-reply@amazonaws.com",
    "date": "2025-09-09 03:03:10",
    "message_id": "1992dedea639611e",
    "body": "(No content)",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "Forbes Contributor & Search Group CEO Interviewed 30,000+ Workforce Personnel: His Take on Finding the Career Meant for You  (New book out 10/7!)",
    "sender": "Marcus@fortierpr.com",
    "date": "2025-09-08 06:18:11",
    "message_id": "199297a1999b5b68",
    "body": "Hey Srinivas, Hope you had a lovely weekend! As you know, career instability and the looming uncertainty facing soon-to-be graduates always seem to dominate headlines; an unfortunate truth underscored by U.S. employee engagement rates hitting a 10-year low in 2024. I’d like to suggest a conversation with William Vanderbloemen, Forbes Contributor & CEO of touted search group, VSG, who’s providing a playbook to reframe how your audience should view the career search. His approach centers on proven assessments that highlight strength traits, distilled from more than 30,000 interviews across the workforce. William’s new book, Work How You Are Wired: 12 Data-Driven Steps to Finding a Job You Love (HaperCollins, 10/7), addresses why some stand out, and others falter, with his original composite called the Vander Index. 12 habits of top performers – each drawn from research of 2,500+ executive searches and 30,000+ interviews exemplifying internal habits that help: Compare traits with prompts & post-chapter assessments that surface core strengths and non-negotiables. Measure natural wiring and career aspirations with Ennegram and DiSC data to make concrete connections that have long-term fulfillment in their career paths Navigate style types (like ‘Connector’ and ‘Anticipator’), and which roles you should actively avoid, and why. Including more detail below. Are you working on anything at the moment that William can add to, or can I share a manuscript in the meantime? Gratefully, Marcus – Work How You Are Wired: 12 Data-Driven Steps to Finding a Job You Love (HaperCollins, 10/7) It’s no secret that some people are just better suited to their jobs than others. It’s time to find out why and how you can achieve this same success and happiness too. Remember taking that career test in grade school where you were told you’d make a great federal judge or an exemplary lighthouse keeper? In this book, executive search CEO William Vanderbloemen takes that concept and maps it against hundreds of thousands of data points, forming a roadmap for all of us on how to choose careers that align with our personalities so that we are happy at work. William has become an unlikely business expert over his long and continuing career. Combining over fifteen years of ministry experience as a Senior Pastor with the best practices of executive search, William created a brand-new industry: executive search for faith-based organizations. Prior to founding his own search company, William studied under a mentor with over twenty-five years of executive search experience at the highest level. William has surveyed thousands of people in the workforce. He’s asked what their job is and how they feel about them. He also asked them to report their scores on leading personality assessments. Now, in this groundbreaking guide, William helps you recognize the traits you possess that make you happy and then match those against your possible careers to find the best match. ABOUT WILLIAM VANDERBLOEMEN: William Vanderbloemen has been leading the Vanderbloemen Search Group for 15 years, where they are regularly retained to identify the best talent for teams, manage succession planning, and consult on all issues regarding teams. This year, Vanderbloemen will complete their 3,000th executive search. Prior to founding Vanderbloemen Search Group, William studied executive search under a mentor with 25+ years of executive search at the highest level. His learning taught him the very best corporate practices, including the search strategies used by the internationally known firm Russell Reynolds. Prior to that, William served as a Senior Pastor at one of the largest Presbyterian Churches in the United States. ______________ Marcus Plummer marcus@fortierpr.com | (609) 415 7202 Fortier Public Relations | www.fortierpr.com New York, NY",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "Action required – Your AWS account is past due",
    "sender": "no-reply@amazonaws.com",
    "date": "2025-09-06 02:13:15",
    "message_id": "1991e4d20af75204",
    "body": "(No content)",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "Re: Minor Update to OrchestrateOS — No Action Required After This",
    "sender": "pamela@pamelawilson.com",
    "date": "2025-09-05 06:49:54",
    "message_id": "1991a240ffe9188c",
    "body": "I’ve been slammed with projects and meetings this week, but should have a little time to look at this again this afternoon.Am I still following the instructions here?🛠️ How to Update Your OrchestrateOS Setupunmistakablemedia.getoutline.com Pamela✅ PamelaWilson.comAbout Pamela Wilson LinkedIn | Perplexity | Author page On Sep 4, 2025, at 2:43 PM, Srinivas Rao <srini@unmistakablemedia.com> wrote:Pamela, Turns out I was wrong don't eject the container. Open up the dmg and just double click Orchestrate engine again and then pres play and it will work, no nee to go through the install again. On Thu, Sep 4, 2025 at 9:04 AM Srinivas Rao <srini@unmistakablemedia.com> wrote:Hey Pamela, If you click on my computer and eject the mount and restart th docker by pressing stop and play it should resolve the issue. Let me know it doesn't work and I'll hopon call with you. On Tue, Sep 2, 2025 at 5:47 AM Pamela Wilson <pamela@pamelawilson.com> wrote:Hey Srini,I ran into a snag — looks like it might be a Docker file sharing issue?Here are the error messages:Docker, when I try to run the Container:<Screenshot 2025-09-02 at 7.24.45 AM.png>I did unmount the Orchestrate installer and it looks like it’s still searching for it.Terminal:<Screenshot 2025-09-02 at 7.23.52 AM.png> It’s mostly a foreign language to me, but hopefully you can make sense of it.I’ve got a big client project to focus on today, and can get back to the Orchestrate update tomorrow afternoon.Thanks,Pamela✅ PamelaWilson.comAbout Pamela Wilson LinkedIn | Perplexity | Author page On Sep 1, 2025, at 5:46 PM, Srinivas Rao <srini@unmistakablemedia.com> wrote:Hey Pamela, We’re making a small but important update to OrchestrateOS that’ll make the system easier to use — and you won’t need to make any changes after this. With this new setup, anytime we release new tools, you’ll automatically see them in your dashboard under the section called Orchestrate App Store. 👉 Click here for setup instructions You’ll just need to run two simple scripts. The guide explains everything clearly — but if anything is confusing, feel free to: 📱 Text me: 510-697-6334 📅 Or book time with me here: https://book.nylas.com/us/b0638254-2602-47c2-855d-d2fc03921d7e/srini-call —Srini P.S. We’ll be releasing a new in-app feedback tool this week so you can submit feedback or feature requests directly through Orchestrate. Since you’re one of our earliest users, you can always reach out directly — text, call, whatever you need. -- Srinivas Rao Host/Founder at The Unmistakable Creative Podcast W https://unmistakablecreative.com/ E srini@uninmistakablemedia.com P : https://podcast.unmistakablecreative.com/ Create your own email signature -- Srinivas Rao Host/Founder at The Unmistakable Creative Podcast W https://unmistakablecreative.com/ E srini@uninmistakablemedia.com P : https://podcast.unmistakablecreative.com/ Create your own email signature",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "Ready when you are.",
    "sender": "Kevin@businesscoachingforcreatives.com",
    "date": "2025-09-04 13:08:48",
    "message_id": "199165894edd6a08",
    "body": "I have a 4:30pm On Sep 4, 2025, at 3:44 PM, Srinivas Rao <srini@unmistakablemedia.com> wrote: Join with Google MeetMeeting linkmeet.google.com/tno-cnrt-ehdJoin by phone(US) +1 234-759-0327PIN: 627695486More phone numbersWhenThursday Sep 4, 2025 ⋅ 1:30pm – 2:15pm (Pacific Time - Los Angeles)GuestsSrinivas Rao - organizerkevin@businesscoachingforcreatives.comView all guest infoReply for kevin@businesscoachingforcreatives.comYesNoMaybeMore optionsInvitation from Google CalendarYou are receiving this email because you are an attendee on the event.Forwarding this invitation could allow any recipient to send a response to the organizer, be added to the guest list, invite others regardless of their own invitation status, or modify your RSVP. Learn more<Mail Attachment.ics><invite.ics>",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "FYI: getting error after Following the onboarding directions",
    "sender": "kevinmurban@gmail.com",
    "date": "2025-09-04 11:18:46",
    "message_id": "19915f3da92cb1de",
    "body": "FYI: Followed the onboarding directions. Installed ngrok using terminal and home-brew. Logged into Docker. Have it running in background. Set up grok using home-brew. Getting this error when asking to visit site. On Sep 3, 2025, at 9:29 PM, Srinivas Rao <srini@unmistakablemedia.com> wrote:Hey Kevin,Thanks again for signing up — your note stood out right away.It’s clear you’re already navigating a serious stack (Mem, Claude, GPT, Kit), and that’s exactly what OrchestrateOS is built for. It’s not another chatbot — it’s a real-time execution layer that helps you move between tools, content, and workflows without friction.If you’re using Mem.ai, you’ll feel right at home — Orchestrate has native support for Mem-style capture, but with more structure, routing, and control. You’ll be able to: Draft and publish your weekly newsletter faster (Outline Editor) Route notes and snippets into structured actions (Notes + JSON Manager) Connect Dropzone inputs to smart task flows And even build custom logic for repeatable sequences 🛠️ Schedule Your Onboarding Call: https://book.nylas.com/us/b0638254-2602-47c2-855d-d2fc03921d7e/srini-call Preparing for Onboarding✅ Step 1: Install Docker - https://www.docker.com/products/docker-desktop - Launch it and leave it running in the background✅ Step 2: Set Up ngrok - https://dashboard.ngrok.com/signup - Copy your authtoken - Choose a custom domain (e.g. clever-bear.ngrok-free.app)Both tools are lightweight, free, and power the containerized system underneath Orchestrate. Looking forward to walking through your setup and wiring in your flow. This one’s going to feel different.— Srini Creator, OrchestrateOS",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "Re: Quick follow-up — you're exactly who we built this for",
    "sender": "Kevin@businesscoachingforcreatives.com",
    "date": "2025-09-03 19:02:15",
    "message_id": "1991275d3a499bba",
    "body": "Looking forward to the walk-through tomorrow, Thursday the fourth at 4 PM. I use kit for my newsletter. Specifically, I use the newsletter account, so I don’t know if they grant API access. I use go high-level for my landing pages, funnels/workflows and CRM. KevinSent from my iPhoneOn Sep 3, 2025, at 9:51 PM, Srinivas Rao <srini@unmistakablemedia.com> wrote:﻿Hey Kevin, I don’t usually send second emails like this — but after reading your submission and doing a bit of research on your work, I wanted to say this clearly: You’re not just a good fit for Orchestrate — you’re literally the person we built it for. Your stack (Mem, Claude, GPT, Kit), the way you talk about navigating tools and content, your focus on creative systems — it lines up almost exactly with what this system was designed to support. This isn’t an AI wrapper. Orchestrate is a structured workspace where ideas, notes, tasks, and content move together — and you don’t need to bolt on duct tape to make it all flow. To be blunt: We need users like you more than you need more tools. If you’re still interested, I’d love to walk you through onboarding personally. Here’s the link again: 👉 Schedule your onboarding: https://book.nylas.com/us/b0638254-2602-47c2-855d-d2fc03921d7e/srini-call And if now’s not the time, no pressure — I just wanted you to know we’re paying attention. You’re exactly the kind of operator we’re building with, not just for. P.S. Let us know what tool you’re currently using for your newsletter. If it has a public API that allows for sending + draft creation, we’ll build the integration — and have it ready before your onboarding call. We’ve already got ConvertKit and Mailjet live. Substack unfortunately doesn’t offer a real API — but we’ll show you how to replace it cleanly if that’s what you’re using. And just for fun: This follow-up email was sent directly through OrchestrateOS. — Srini Creator, OrchestrateOS https://orchestrateos.com",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "Let’s Keep the Connection Flowing 🌟 Re: Scheduling your OrchestrateOS Onboarding",
    "sender": "radiantrebecca@happyjoyfulpeople.com",
    "date": "2025-09-03 18:24:02",
    "message_id": "1991252d67b952fc",
    "body": "Hi there!Thank you for reaching out! I truly value our connection and the time you’ve taken to write. I wanted to share a bit about how I’m working these days, and why:My priority these days is spending as much of my day as possible connecting physically with people—whether that’s through coaching sessions, gatherings, or collaborative moments—and as little time behind my computer or phone as I can. It just feels better to be with humans and to connect where we can feel and see and hear each other. If what’s in this email can wait until we see each other in person, that’s awesome! Let’s chat face-to-face when the opportunity arises.If not, and if you know my cell phone number, you’re welcome to text or call me. While I do spend lots of time with my phone on Do Not Disturb, I use text for logistic planning and check it a few times a day. It’s a great way to let me know if you’d like to connect sooner or have something time-sensitive.Here are a few ways we can connect in the meantime:Coaching Clients: Ready to dive deeper into flow? Visit https://www.workwithradiantrebecca.com to learn more about my offerings and to book your session.Listen In: I’ve shared thoughts and reflections regularly on my podcast—listen here: https://www.workwithradiantrebecca.com/listen.Response Time: I check this inbox a few times a week, so you can expect a thoughtful reply within 48 hours if this is something that needs a reply. Thank you for your understanding and for making this connection meaningful. I can’t wait to explore what’s next together!Warmly and with connection,Rebecca 🌟-- Rebecca Beltran 🌟 Coaching for Flow & Connector of Ideas and People Helping you reclaim flow and thrive in life, work, and love. 🌐 Explore: [Coaching Offerings](https://www.workwithradiantrebecca.com) 🎙 Listen: [Pleasure Central Radio](https://www.workwithradiantrebecca.com/)",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "re: HOW I KNOW WHITE PEOPLE ARE CRAZY—a Black psychologist on the mental health system's failures",
    "sender": "emma@pressshoppr.com",
    "date": "2025-09-03 10:59:20",
    "message_id": "19910bbb2093a144",
    "body": "Dear Srinivas,I'm following up to see if you'd like a copy of psychologist Dr. Jonathan Mathias Lassiter’s forthcoming essay collection, HOW I KNOW WHITE PEOPLE ARE CRAZY AND OTHER STORIES (Legacy Lit; November 4, 2025), which is a pointed critique of racism in the mental health field—as well as a vivid recollection of growing up Black and gay in a world that privileges the white, straight, and wealthy. From experiencing racism as a child in Augusta, Georgia, to alienation in San Francisco—within both queer and straight communities—Lassiter weaves personal narrative with professional insight, exposing systemic barriers facing Black and POC psychologists and patients. Throughout, he challenges the dominance of the “whiteness mindset” (a worldview rooted in competition and individualism that continues to shape American psychology) and asks us to reimagine the field of mental health so that it wholly meets the needs of POC, LGBTQ+, and disabled communities. With HOW I KNOW WHITE PEOPLE ARE CRAZY, Dr. Lassiter asks, what would mental healthcare look like if it centered lived experience and healing over hierarchy?Can I send you a copy? Dr. Lassiter is a great conversationalist and is available for interviews.Best,Emma McGlashenshe/theyPublicistC: 734 834 0737www.PressShopPR.comABOUT THE AUTHORJonathan Mathias Lassiter, PhD is a polymath whose mission is to help others heal and thrive. He is a licensed clinical psychologist, author, speaker, and educator. Dr. Lassiter has been featured in NBC, PBS, Sirius XM, Forbes, and more. His psychotherapy practice is based in New York City.Q&A WITH JONATHAN LASSITERThis book gives voice to your frustration with how psychology, as it’s commonly taught and practiced, neglects patients who aren’t white, straight, and/or able-bodied. The essays, however, touch on subjects as wide-ranging as the racism you endured as a child in Georgia to your disillusionment with San Francisco’s gay community. How do these varied experiences illuminate the broader problems in psychology and the state of social justice in this country?The stories put a human face on a problem, “the whiteness mindset,” that is wreaking harm on our society and the field of mental health, past, present, and potentially future. The whiteness mindset is believing and behaving as if “there is not enough to go around,” one must “divide and conquer” and “kill or be killed.” This mindset protects certain people, their dominance, their position–but it also hurts them, and not just people who look like me. This book looks at how all of us are affected by this mindset. The stories provide an emotional anchor for a psychological and philosophical ill. The stories also illustrate how the mindset, when it runs rampant, impacts not just society’s mental health but also the politics around us. Let’s look at the civil unrest happening now: they can only arise when a society embodies and perpetuates the whiteness mindset. The whiteness mindset has convinced past immigrants, poor people of all races, and other would-be allies that a scapegoat – “illegal immigrants” – are their enemies and are taking away resources from them. They don’t see one another as being part of a growing community but as competition and a threat who must be eliminated.The field of psychology, with its foundation in Western Europe, is steeped in this culture. How can we change that? The whiteness mindset predominates now but such has not always been the case. We change that by embracing a more ancient mindset–one rooted in the original societies of African, Asia, and South America–that embraces unity, balance, harmony, and justice. We change the field of psychology by putting these mindsets front and center and not making them electives or special topics but the core of how we understand and practice healing and how we engage in our relationships.Throughout the book your voice and humor shine through. In one essay you share a darkly funny story about an internship where each participant had to spend two hours in a setting where they would be a minority. They sent you, a gay Black man, to a sports bar because you don’t like sports—and then they failed you. How does this story encapsulate how mainstream psychology struggles to meet psychologists and patients with different lived experiences? That story exposes psychology’s cultural limitations and myopathy, since western psychology only focuses on European and white ways of understanding and being. Even when discussing mental health problems, psychology only understands them from white perspectives. This narrowness reduces psychology from being a study of the human mind to a study of the white human mind. It cuts off potential non-western ways of healing that could be beneficial to everyone, including white people. Furthermore, the whiteness mindset in psychology ensures that people of the global majority are at best seen as problems to be solved, deviations from a white norm, and never as mental health professionals with legitimate ways of healing outside of European and white standards.In the book you write, “to understand, appreciate, and promote multiculturalism requires a lifelong process. I would de-emphasize diversity and center cultural humility.” What does cultural humility look like and how do you think diversity initiatives fall short?Cultural humility looks like understanding that culture deeply influences everything we do and how we make sense of the world. It also requires that we understand that culture is not something to be mastered or manipulated. We must be continually cultivating a non-judgmental curiosity of how we and others believe, behave, and make sense of the world. Cultural humility is a lifelong process, not an endpoint. Current diversity initiatives often feel like a box to check off.In all sorts of settings, most Black people have experienced being the only Black person in the room. You write, “when you are Black, cultural paranoia—also known as a distrust of white people in predominantly non-Black spaces as a defense against racism—is a healthy thing.” How do you guide clients through alienating situations like this?I first validate their concerns and normalize that they are not alone in feeling this way. I emphasize that these culturally isolating–and often hostile–spaces are the problem, not them. When working with clients experiencing cultural paranoia, one priority is to help them understand their suspicion as a strength they can harness while ensuring it does not override their ability to think and function. I help them to meet their emotions where they are, anticipate potential consequences, and then set boundaries so they don’t have to take these things home. We also work together to build in moments of rejuvenation and joy.When seeing Black patients, where do non-Black psychologists most often fail? What do they miss about Black history, culture, and experiences that keeps them from providing the best possible care?In general, non-Black psychologists do not know Black people or Black culture. They may know of them, but they don’t know them. Lacking a nuanced understanding of the history, culture, and experience is a barrier. Furthermore, without cultural humility and non-judgmental curiosity, Black patients become a set of symptoms to be solved instead of whole human beings to understand and with whom to take a healing journey.PRAISE FOR HOW I KNOW WHITE PEOPLE ARE CRAZY\"This is the best book I’ve read in a long time. It’s so good I wish I had written it. It corroborates the crazy-making experiences of Black Americans that are too often denied or dismissed as over sensitivity by the white power structure and offers strategies for surviving and thriving in an inhospitable world. Every conscientious American should read Dr. Lassiter’s brilliant book.\" ―Dr. Carl Hart, author of Drug Use for Grown-Ups\"Phewwwww, this book!!! Damn every white person needs to read it.\" ―Dr. Courtney Tracy, author of Your Unconscious is Showing\"Pulling from his lived experience and his work as a psychologist, Lassiter breaks down how 'whiteness' operates as a mindset built on division and control. This bold and necessary book challenges us to name it, undo it, and begin the real work of healing. It’s a call toward collective liberation.\" ―Clay Cane, New York Times bestselling author of The Grift\"Dr. Lassiter's fierce, funny, and furious diagnosis has changed how I think about the ways whiteness shapes the world—and myself. This book about the head is bursting with heart and we learn as we watch him attempting to navigate a world whose framework is founded on the often absurd propositions of whiteness.\" ―Baynard Woods, author of Inheritance\"During a time of racial disinformation and bigotry, Dr. Lassiter's book unpacks this crisis on a psychological and scholarly level. Both insightful and personal, his provocative writing pushes past the dated trope of being another 'Dear White People' reaction—but an empowering literary embodiment of Black resilience that's timely and necessary.\" ―Ernest Owens, author of The Case for Cancel Culture\"Dr. Lassiter is prolific in his teachings and writings, as he honors those who are often overlooked by the majority!!! I am super excited for the world to have a first-row seat in learning how he manages his frustrations in a quest to de-center whiteness, so ALL can live optimally as their full authentic selves.\" ―Dr. Ayana Jordan, Barbara Wilson Associate Professor of Psychiatry at NYU Grossman School of Medicine\"This book is what we’ve been waiting for. It's a must-read. Dr. Lassiter takes us on a necessary emotional roller coaster as he navigates becoming a prolific Black psychologist in a sea of whiteness. Providing readers a diagnostic of 'whiteness' finally gives us the language to describe that which we’ve known for so long as simply 'crazy' behavior. How I Know White People are Crazy and Other Stories is a balm, a testament, a cauldron of healing, stories for that which has plagued us for so long in this society.\" ―Sharrell D. Luckett, PhD, editor of Black Acting Methods",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "OperationalOS Onboarding",
    "sender": "ebertmahon@gmail.com",
    "date": "2025-09-03 09:02:20",
    "message_id": "19910509338ca82a",
    "body": "Greetings Srinivas,I am using Tana as my main PKM application. I should be able to connect to it with OperationalOS? And can I run OperationalOS on my MacBook and iMac at home? Thanks,Ebert",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "Why You Love Your Favorite Brands—And How Their Behavioral Science Secrets Can Grow Your Own Brand",
    "sender": "camille@fortierpr.com",
    "date": "2025-09-03 08:36:07",
    "message_id": "199103895244973d",
    "body": "Hi Srinivas, I hope you had a nice weekend! I'm sharing a guest opportunity with you for the show. The world’s best brands didn’t just stumble on success; they mastered the art of hacking human psychology. In HACKING THE HUMAN MIND: The Behavioral Science Secrets Behind 17 of the World’s Best Brands, MichaelAaron Flicker and Richard Shotton reveal the behavioral science behind these tricks. In a conversation with coauthor, founder and host of the Consumer Behavior Lab MichaelAaron Flicker, you'll unpack Behavioral lessons like: Liquid Death’s “Murder Your Thirst”: Breaking category norms (death metal branding for water?) exploits the Von Restorff effect, making it impossible to ignore. Snickers’ “You’re Not You When You’re Hungry”: Humor and a clear trigger (hunger) bridge the gap between intention and action—proven to boost sales by 15.9%. Amazon Prime’s “Sunk Cost Fallacy”: Paying upfront for shipping makes customers spend more to “get their money’s worth”—even when logic says otherwise. Aperol’s Social Proof Hack: Its unmistakable color and glassware turn drinkers into walking billboards, subtly convincing others to order the same. Guinness’s “Pratfall Effect”: Admitting its slow pour time (a flaw!) actually boosted appeal by signaling authenticity and quality. Behavioral science shapes all our choices—Through pop-culture infused conversation, you'll learn tactics that can be applied by marketers, entrepreneurs, or anyone curious about why we buy what we buy, so you too can make your brand the one people reach for―without them ever really knowing why. Would you like to see a copy of HACKING THE HUMAN MIND or schedule some time to speak with MichaelAaron? Here are a couple of relevant examples of MichaelAaron speaking and being interviewed. Would you be interested in having him on the podcast or receiving a book? Call to Action Podcast Masterclass episode (Unpacking the success of Liquid Death) Warmly, Camille Chapman | Fortier Public Relations | camille@fortierpr.com | 603.306.2345 About: MichaelAaron Flicker is an American entrepreneur who builds companies powered by behavioral science. He started his first company at just 14 years old. He is the founder and CEO of XenoPsi Ventures, a brand incubator firm that owns, operates and invests in over a dozen companies. As a regular partner to CEOs and their executive teams, he applies behavioral science to unlock brand value and accelerate growth. He is also a regular contributor to Fast Company and other leading industry publications. MichaelAaron is the founder of the Consumer Behavior Lab, an initiative dedicated to advancing the marketing industry through evidence-based insights. Named one of NJBIZ’s “40 Under 40,” his companies have been recognized for three consecutive years on the Inc. 5000 list of America’s fastest-growing private businesses.",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "Podcast Must-Haves: 8-Figure CEO + Top Host of Coffee for Closers w/ 1M+ Followers Online and 9-Figure Founder Building Unstoppable Entrepreneurs & Impactful Legacies!",
    "sender": "Sam@podpromax.com",
    "date": "2025-09-02 12:15:34",
    "message_id": "1990bdb21c7647c2",
    "body": "Hi Srini, I’d love to introduce to you Joseph Shalaby, who is a magnetic voice in entrepreneurship and leadership. He’s a CEO who built an 8-figure empire from the ground up, has cultivated a massive online presence with 1M+ followers across platforms, and hosts one of the most talked-about business podcasts today: Coffee for Closers. But here’s what really makes Joe a can’t-miss guest: He knows how to build powerhouse teams, scale fast in competitive markets, and lead with clarity and confidence. He’s not just talking about success, he’s also creating real movements that empower founders, creators, and closers to own their lanes and multiply their impact. Joseph has been featured on top podcasts like The Money Mondays (with Dan Fleyshman), LifeBlood, School's Over... Now What?, and The Unconventional Life with Jules Schroeder to name a few, and brings fresh, actionable insights around: Building with faith, values, and vision The real mindset behind winning in any economy How to scale a service based business to 8+ figures What it takes to build trust and influence with 1M+ online What do high earners get wrong about leadership and legacy Creating systems that give entrepreneurs their freedom back He’s built one of the largest non-delegated lending companies in the U.S., but his story goes far beyond real estate. Joseph is now a sought-after voice for shows that dive deep into business growth, leadership, personal development, and ownership. ---------------------------------------------------------------------------------------------------------------------------------------------------------- Stephen Scoggins isn’t just another business coach—he’s a battle-tested entrepreneur who went from sleeping in his car to building multiple 9-figure businesses. He’s lived the struggle, cracked the code, and now empowers others to build thriving businesses without burnout, fear, or sacrificing their purpose. As the founder of The Unstoppable Movement and host of the Build (w) Stephen Scoggins podcast, Stephen delivers raw, relatable, and results-driven insights on: 🔥 Scaling businesses with clarity & confidence 🔥 Breaking free from fear, burnout, and limiting beliefs 🔥 Leadership & mindset mastery for high achievers 🔥 Finding fulfillment while building wealth 🔥 Creating a business legacy that outlasts you If your audience is filled with entrepreneurs, leaders, and go-getters hungry for more than just hustle culture, Stephen is the guest who will wake them up, fire them up, and show them how to build a business they actually love. Why Your Listeners Will Love Him: ✔Real-World Experience Over Theory – No fluff. Just proven strategies from a self-made, 9-figure entrepreneur. ✔Holistic Success Approach – He teaches how to win in business and life—without sacrificing one for the other. ✔Raw & Relatable Storytelling – From homeless to high-performance, his journey is a blueprint for resilience. ✔High-Energy & Actionable – No generic motivation—only real, implementable strategies that move the needle. Stephen and Joe are on a mission to help ambitious leaders scale their businesses without losing themselves in the process. If you want an unforgettable episode packed with powerful takeaways, breakthrough moments, and real strategies your audience can apply immediately, Stephen and Joe are the guests you need. This is the kind of conversation your audience will be talking about long after it airs. Just let me know if you’re open to locking in a date, and we’ll take care of the rest! Best regards, Sam",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "sell Unmistakable Media?",
    "sender": "i.white@batontideroute.co",
    "date": "2025-09-02 12:01:54",
    "message_id": "1990bce9f53c78b2",
    "body": "Hi Srinivas, If I had buyers targeting media production companies and your company matches perfectly what they were looking for, would you be open to selling if the price were right? Thanks, Isabella",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "What Working Women Can Learn from Taylor Swift's Strategic Success",
    "sender": "camille@fortierpr.com",
    "date": "2025-09-02 07:58:31",
    "message_id": "1990aefcbdde0974",
    "body": "Hi Srinivas, Taylor Swift just proved you can have record-breaking career success AND a thriving relationship—but not by trying to excel at everything simultaneously. Her approach offers a blueprint that everyday working women can actually follow. Taylor Swift is the perfect example of how any ambitious woman can use the practical strategies from Amanda Goetz's new book, Toxic Grit: How to Have It All and (Actually) Love What You Have (Sourcebooks, October 21, 2025) to achieve HER goals. What working women can steal from Taylor's playbook: Rotate your main character like Swift - Focus intensely on career goals for defined periods (like Swift's 2-year Eras Tour commitment) while keeping relationships on maintenance mode, then flip the script. Bake bread for Zoe Kravitz, binge The Summer I Turned Pretty, etc.Plan recovery like you plan launches - Swift's strategic breaks between projects aren't downtime, they're essential \"spin cycles\" that prevent burnout and fuel creativity, something corporate women desperately need.Master role transitions - Swift seamlessly shifts from business negotiator to vulnerable artist to supportive partner by treating each as a distinct \"characters\" with different energy requirements.Communicate your season to your inner circle - Swift's team and Travis know when she's in full work mode versus relationship mode, eliminating the guilt of not being \"everything to everyone.\" Swift doesn't try to be at 100% in all areas simultaneously. Working women can apply this by identifying which \"character\" (professional, partner, friend, parent) gets front-burner focus each quarter while keeping others on intentional maintenance. You can see some of her insights featured here on CNBC Make It. Would you be interested in speaking with her about why Taylor Swift's been so successful in both work and life, how other ambitious women can follow in suit and other insights from Amanda’s book Toxic Grit? Amanda can break down these strategies into actionable steps for your audience. Best, Camille Camille Chapman | Fortier Public Relations | camille@fortierpr.com | 603.306.2345 About the Author Amanda Goetz is a 2x founder, 4x chief marketing officer, and was a single mom to three small children before finding love again. In her new book, Toxic Grit: How to Have It All and (Actually) Love What You Have (Sourcebooks, October 21, 2025), Goetz shares what it took to climb the corporate ladder, build and sell House of Wise (a CBD supplement company targeting women) all while being a single mom and enjoying the life she was building. She spent two decades building and growing consumer-facing brands before shifting to writing, teaching, and coaching ambitious working parents on how to balance success and life, amassing 150,000+ followers learning to balance success and sanity from her. She graduated summa cum laude from the University of Illinois and, after hustling the streets of New York City for over a decade, is now testing out every sunscreen in the world on her children in Miami. Press Kit Linked Here.",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "Re: Minor Update to OrchestrateOS — No Action Required After This",
    "sender": "pamela@pamelawilson.com",
    "date": "2025-09-02 05:47:27",
    "message_id": "1990a77cb083b9b3",
    "body": "Hey Srini,I ran into a snag — looks like it might be a Docker file sharing issue?Here are the error messages:Docker, when I try to run the Container:I did unmount the Orchestrate installer and it looks like it’s still searching for it.Terminal: It’s mostly a foreign language to me, but hopefully you can make sense of it.I’ve got a big client project to focus on today, and can get back to the Orchestrate update tomorrow afternoon.Thanks,Pamela✅ PamelaWilson.comAbout Pamela Wilson LinkedIn | Perplexity | Author page On Sep 1, 2025, at 5:46 PM, Srinivas Rao <srini@unmistakablemedia.com> wrote:Hey Pamela, We’re making a small but important update to OrchestrateOS that’ll make the system easier to use — and you won’t need to make any changes after this. With this new setup, anytime we release new tools, you’ll automatically see them in your dashboard under the section called Orchestrate App Store. 👉 Click here for setup instructions You’ll just need to run two simple scripts. The guide explains everything clearly — but if anything is confusing, feel free to: 📱 Text me: 510-697-6334 📅 Or book time with me here: https://book.nylas.com/us/b0638254-2602-47c2-855d-d2fc03921d7e/srini-call —Srini P.S. We’ll be releasing a new in-app feedback tool this week so you can submit feedback or feature requests directly through Orchestrate. Since you’re one of our earliest users, you can always reach out directly — text, call, whatever you need.",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "Re: AI’s Dirty Little Secret",
    "sender": "james@brimfuldrinks.co.uk",
    "date": "2025-09-01 16:21:43",
    "message_id": "19907962165d5f26",
    "body": "So true! Talk about emperor's new clothes. 23 Aug 2025 20:06:34 srini@unmistakablemedia.com: AI was supposed to save you time. Instead, it gave you a second job. A few months ago I was trying to optimize Raycast. It has AI built in, but to get it working the way I wanted, I had to open ChatGPT and ask it how to talk to Raycast’s AI—just so it could run a simple audit. That’s when it hit me: I’m using one AI to figure out how to use another AI so that other AI can maybe do something it should already know how to do. This isn’t a Raycast problem. It’s everywhere. You ask GPT for an image prompt, paste it into a generator, and the result sucks—so you’re back rewriting the prompt, repasting, and trying again. Then you ask it for an email, and now you’re fixing the tone, cleaning up the formatting, copying it into another app, and rewriting half of it because the output is garbage. This is the loop: one tool gives you a broken piece of something, another gives you a different broken piece, and none of them finish the job. And every step in between? That’s on you. You’re formatting, reformatting, renaming files, rewriting prompts, re-explaining what you’re trying to do, regenerating, and cleaning up messes from systems that pretend they’re doing the work. Whatever time you think AI is saving you, you lose dealing with all the stupid things it makes you do. It doesn’t know what you’re building, remember what you said, and has no clue what comes next—it just dumps half-finished output in your lap and leaves you to clean it up. Tomorrow, we’ll look at why nobody in their right mind would ever replace a real employee with this bullshit.",
    "tags": [
      "Relax"
    ]
  },
  {
    "subject": "Re: Are you Unmistakable Media Founder?",
    "sender": "muhammadtayyab.gwabusiness2@gmail.com",
    "date": "2025-08-31 13:26:34",
    "message_id": "19901cf688959531",
    "body": "Hi Srinivas, I wanted to follow up on my previous message. If you're interested, I'd be happy to arrange a brief meeting to discuss your requirements. Looking forward to your response! Best regards, Muhammad On Thu, Aug 21, 2025 at 2:18 AM Muhammad Tayyab wrote: > > Hi Srinivas, > > I recently came across you're the Founder at Unmistakable Media. I > wanted to quickly introduce the services I provide that could support > your projects. > > This is what I can help you with for just 15 USD per hour: > > - Video & Audio Editing > - Podcast Production > - Content Creation > - Administrative Assistance > - Social Media Management > - Lead Generation > - Appointment Booking > - Website Development > > If you are interested in any of these, I’d be happy to set up a Zoom meeting. > > Looking forward to your response. > > Best regards, > Muhammad",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "Re: Orchestrate Call + Note Tool Recommendation",
    "sender": "pamela@pamelawilson.com",
    "date": "2025-08-30 11:40:00",
    "message_id": "198fc477d2288c14",
    "body": "I used the Share function in Outline and copied the sharing generated link: Are you not seeing it?The only other option is to add you to my workspace, which I can do if needed — let me know.This is my Outline email address — looking forward to seeing the guides.Pamela✅ PamelaWilson.comAbout Pamela Wilson LinkedIn | Perplexity | Author page On Aug 30, 2025, at 12:49 PM, Srinivas Rao <srini@unmistakablemedia.com> wrote:yeah, that sounds great, I think the easiest thing though is use share function in outline so that wa yI see the doc show up in my outline editor. Also is this the same email address you use for outline? I'll be sharing the user guides with you later today. That way I automatically see it without needing the link. Keep me posted, I'm making some changes based on your onboarding that will simplify things like seeing updates a lot. Will send you details on that part tomorrow, nothing major you'll just make an update to your instructions in the gpt. On Sat, Aug 30, 2025 at 7:19 AM Pamela Wilson <pamela@pamelawilson.com> wrote:Good morning, Srini!I thought the easiest way to provide feedback on my early testing would be to set up and share an Outline collection with you.It’s going to be a bit stream-of-consciousness, I suspect, but maybe that’s a good thing?Here’s the link: https://pamelawilson.getoutline.com/s/78910c33-9913-4d7e-ba0f-86c21c3d9e1b Pamela✅ PamelaWilson.comAbout Pamela Wilson LinkedIn | Perplexity | Author page On Aug 29, 2025, at 2:21 PM, Srinivas Rao <srini@unmistakablemedia.com> wrote:Hey Pamela,Looking forward to showing you what Orchestrate can do. Here’s the link for our video call:Video call link: https://meet.google.com/pzv-whoa-qrhAlso, since you mentioned notes are your main use case, I wanted to make a quick recommendation. Orchestrate does have a built-in note-taking app, but it’s not designed for structured document creation like you saw in the YouTube demo.For that, I highly recommend Outline — it’s similar to Notion but much cleaner and easier to use. To integrate it with Orchestrate, you’ll need a paid account ($10/month), but it’s absolutely worth it.https://www.getoutline.comTalk soon, Srini -- Srinivas Rao Host/Founder at The Unmistakable Creative Podcast W https://unmistakablecreative.com/ E srini@uninmistakablemedia.com P : https://podcast.unmistakablecreative.com/ Create your own email signature",
    "tags": [
      "Reply"
    ]
  },
  {
    "subject": "Re: Orchestrate Call + Note Tool Recommendation",
    "sender": "pamela@pamelawilson.com",
    "date": "2025-08-30 07:19:15",
    "message_id": "198fb58c54b7b521",
    "body": "Good morning, Srini!I thought the easiest way to provide feedback on my early testing would be to set up and share an Outline collection with you.It’s going to be a bit stream-of-consciousness, I suspect, but maybe that’s a good thing?Here’s the link: https://pamelawilson.getoutline.com/s/78910c33-9913-4d7e-ba0f-86c21c3d9e1b Pamela✅ PamelaWilson.comAbout Pamela Wilson LinkedIn | Perplexity | Author page On Aug 29, 2025, at 2:21 PM, Srinivas Rao <srini@unmistakablemedia.com> wrote:Hey Pamela,Looking forward to showing you what Orchestrate can do. Here’s the link for our video call:Video call link: https://meet.google.com/pzv-whoa-qrhAlso, since you mentioned notes are your main use case, I wanted to make a quick recommendation. Orchestrate does have a built-in note-taking app, but it’s not designed for structured document creation like you saw in the YouTube demo.For that, I highly recommend Outline — it’s similar to Notion but much cleaner and easier to use. To integrate it with Orchestrate, you’ll need a paid account ($10/month), but it’s absolutely worth it.https://www.getoutline.comTalk soon, Srini",
    "tags": [
      "Read"
    ]
  }
]